# POSTTEST 2

***NAMA : GALUH ENDAH PAMBUDI***
***NIM : 21091006142***

***1. Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.***

In [ ]:
import pandas as pd

produk = pd.read_csv('product_reviews_dirty.csv')
produk = produk.select_dtypes(["float","int"])
produk.describe()

***2. Tampilkan 10 record pertama dari dataset dengan attribute bertipe angka***

In [3]:
produk = produk.select_dtypes(["float","int"])
produk.head(10)

   Unnamed: 0  rating  product_id  shop_id
0           1       5   418660637  1740837
1           2       5   416032545  1477109
2           3       5   416032545  1477109
3           4       5   102279869   771395
4           5       5   190679689   969999
5           6       5   190679689   969999
6           7       5   190679689   969999
7           8       5   190679689   969999
8          10       5   316217334   231740
9          11       5   316217334   231740

***3. Tampilkan informasi jumlah record, jumlah attribute, nama attribute, jumlah attribute dengan tipe angka. Masukkan informasi tersebut dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.***

In [8]:
record, attribute = produk.shape
jml_object = produk.select_dtypes(["float", "int"]).any().sum()
nama_attribute = produk.columns.values
jml_null = produk.isnull().any().sum()

info = {"Jumlah Record :": record, 
        "Jumlah Attribute :" : attribute, 
        "Nama Attribute : " : list(nama_attribute), 
        "Jumlah Object :" : jml_object, 
        "Jumlah Nilai Null :": jml_null}

for x in info :
    print(x, info[x])

Jumlah Record : 40607
Jumlah Attribute : 4
Nama Attribute :  ['Unnamed: 0', 'rating', 'product_id', 'shop_id']
Jumlah Object : 4
Jumlah Nilai Null : 0

***4. Tampilkan nilai dataset pada baris dimulai dengan 3 digit NIM akhir hingga data terakhir dan kolom ke 4 hingga kolom terakhir menggunakan ke 2 metode slice.***

In [10]:
# Menggunakan iloc untuk slicing
metode1 = produk.iloc[142:, 3:]
metode1

       shop_id
142     580197
143     580197
144     580197
145     580197
146     580197
...        ...
40602   648559
40603   648559
40604   648559
40605   648559
40606   648559

[40465 rows x 1 columns]

In [11]:
# Menggunakan loc untuk slicing
metode2 = produk[142:].iloc[:, 3:]
print(metode2)

       shop_id
142     580197
143     580197
144     580197
145     580197
146     580197
...        ...
40602   648559
40603   648559
40604   648559
40605   648559
40606   648559

[40465 rows x 1 columns]

***5. Tampilkan jumlah label dari semua attribute yang bernilai object (contoh : Jenis Kelamin, Agama).****

In [12]:
produk = pd.read_csv('product_reviews_dirty.csv')
objek = produk.select_dtypes(include=['object'])
jumlah_nilai_unik = objek.nunique()
jumlah_nilai_unik

text            37301
category            5
product_name     3647
sold              305
product_url      3664
dtype: int64